Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.RebarItemExists Method
 Check RebarItem is available in database file
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool RebarItemExists(
	RebarItem rebarItem
)
Public Shared Function RebarItemExists (
	rebarItem As RebarItem
) As Boolean
Parameters
rebarItem
Type: Tekla.Structures.Catalogs.RebarItem
rebarItem to check with rebar db
Return Value
Type: Boolean
True on rebar item exist in data base
See Also
Reference
RebarItemEnumerator Class
Tekla.Structures.Catalogs Namespace